{
  "keywords": {
    "depression": [
      "sadness",
      "unmotivated",
      "lack of focus",
      "sleeping too much"
    ],
    "anxiety": ["nervous", "fear", "restlessness"],
    "ptsd": ["trauma", "flashbacks", "nightmares"]
  },
  "sample_answers": {
    "anxiety": {
      "Can you describe how you have been feeling emotionally over the past few weeks?": [
        "My mind won’t shut off. I overthink everything—what if I fail? What if people judge me? I’ve been having panic attacks at work, and my chest feels tight all the time. Even small decisions feel overwhelming. I’m exhausted but can’t relax.",
        "I’ve been feeling like something terrible is about to happen, even when there’s no reason. My heart races, and I avoid social situations because I’m scared I’ll embarrass myself. I can’t focus, and I’ve been snapping at people I love. I just want to feel calm again."
      ],
      "Have you experienced any changes in your daily habits or routines that you’ve noticed recently? How has this affected you?": [
        "Lately, I’ve been avoiding certain activities, especially social ones, because I feel more anxious than usual. My daily routine has changed as I spend more time alone, trying to avoid stressful situations. It’s starting to affect my work, as I feel overwhelmed and unproductive.",
        "I’ve become more focused on checking everything around me, like making sure the door is locked or my phone is charged, which is adding extra steps to my routine. While I feel some relief when I do these things, it’s starting to feel like it’s taking over my day and causing more stress."
      ],
      "Can you tell me about a time when you felt overwhelmed? What caused it, and how did you cope?": [
        "I often feel overwhelmed when there are too many things to juggle at once. One specific instance was when I had a lot of tasks at work and also had personal issues at home. My anxiety started to spiral, and I couldn’t focus. I ended up taking a short break, practicing mindfulness, and speaking with a therapist, which helped me regain perspective.",
        "I was overwhelmed during a family event where everyone expected a lot from me. My anxiety took over, and I couldn’t function properly. I ended up removing myself from the situation and took deep breaths to calm down. Later, I started practicing anxiety-reducing techniques like yoga and seeking professional help to better manage anxiety."
      ],
      "What are some things you’ve been thinking about that seem to cause you a lot of distress or discomfort?": [
        "I keep thinking about worst-case scenarios in everything I do. Whether it’s a work presentation or a simple conversation, I imagine things going wrong, and it makes me feel anxious and distressed. I can’t seem to shake off these thoughts.",
        "Lately, I’ve been obsessing over the idea of things going out of control in my life. I worry that something bad is always around the corner. These constant thoughts make me anxious and sometimes even paralyzed with fear."
      ],
      "How do you typically cope with situations that make you anxious or uncomfortable?": [
        "I cope with my anxiety by constantly trying to control every situation around me. I make detailed plans and double-check everything to make sure nothing goes wrong. It’s tiring, but it gives me a sense of control.",
        "When I feel anxious, I try to distract myself by focusing on other tasks or avoiding the source of my anxiety. It works for a while, but deep down I know I’m not really facing the issue."
      ],
      "Have there been any significant life changes that have affected how you view yourself or your relationships with others?": [
        "After experiencing a series of panic attacks, I became more cautious about my interactions with others. I started pulling away from people, fearing that they wouldn’t understand. It’s changed how I view myself as well, making me feel weak and fragile.",
        "My anxiety has made me more dependent on certain people for reassurance. It’s difficult because I’m aware that I rely too much on others for comfort, which makes me feel insecure and unsure of my own abilities."
      ],
      "Do you feel like you have control over your actions and decisions, or do you ever feel like something is taking over your thoughts or behavior?": [
        "I often feel like my anxiety takes control of my thoughts. It’s like my mind spirals into worst-case scenarios, and I can’t stop it. It makes it hard for me to make decisions because I’m always second-guessing myself.",
        "There are days when I feel paralyzed by anxiety, like I can’t make simple decisions without worrying about every possible outcome. My thoughts take over, and I feel like I’m not in control of my own mind."
      ],
      "Have you had trouble sleeping lately? If so, what do you think is affecting your sleep?": [
        "I have trouble falling asleep because my mind keeps racing. I think about everything that could go wrong, and I can’t turn off my thoughts. It feels like my anxiety doesn’t let me rest.",
        "I’ve been having nightmares and waking up in the middle of the night, feeling anxious. It’s hard to get a good night’s sleep because my anxiety keeps me on edge even when I try to sleep."
      ],
      "Can you describe a situation or experience where you felt disconnected from your emotions or from others around you?": [
        "I’ve had moments where my anxiety completely took over, and I couldn’t connect with how I was feeling. I felt numb and distant from others, almost like I was watching everything from the outside.",
        "When I’m overwhelmed with anxiety, I sometimes zone out. It’s like I disconnect from my emotions and the people around me. It’s as if I’m present but not truly there, emotionally or mentally."
      ]
    },
    "depression": {
      "Can you describe how you have been feeling emotionally over the past few weeks?": [
        "I feel empty, like I’m moving through fog. Getting out of bed is a struggle, and nothing brings me joy anymore. I cry for no reason, and even small tasks feel impossible. I just want to sleep all the time.",
        "These past few weeks, I’ve been numb. I put on a smile around others, but inside, I’m drowning. I don’t see the point in anything. The guilt of not being ‘better’ makes it worse. I feel like a burden."
      ],
      "Have you experienced any changes in your daily habits or routines that you’ve noticed recently? How has this affected you?": [
        "I’ve been sleeping more than usual and not getting up as early. I don’t feel like doing anything, and my routine has become a cycle of waking up, feeling down, and going back to sleep. I’m finding it hard to focus on work or engage with friends.",
        "I’ve noticed I’m eating more junk food and skipping meals. My daily routine has shifted because I’ve stopped taking care of myself. I feel more sluggish and unmotivated, and it’s affecting my ability to get through the day."
      ],
      "Can you tell me about a time when you felt overwhelmed? What caused it, and how did you cope?": [
        "I felt overwhelmed during a period when everything seemed to go wrong. I was struggling with work, relationships, and just didn’t have the energy to do anything. I barely left my room for weeks. I eventually sought therapy, and through counseling, I learned to manage my symptoms and regain a sense of purpose.",
        "During a particularly hard time, I felt like everything was a burden. I couldn’t find the motivation to get out of bed and face the day. It felt like I was drowning. I reached out to a counselor, and they helped me process my emotions and gave me small steps to work through my depression."
      ],
      "What are some things you’ve been thinking about that seem to cause you a lot of distress or discomfort?": [
        "I often think about how little joy I feel these days. I can’t remember the last time I felt genuinely happy. These thoughts of not being able to enjoy life make me feel even worse about myself and my future.",
        "I think a lot about how I’m not accomplishing anything, no matter how hard I try. I feel like everything I do is pointless. These thoughts constantly make me feel exhausted and discouraged, and I can’t seem to escape them."
      ],
      "How do you typically cope with situations that make you anxious or uncomfortable?": [
        "I tend to withdraw from people and activities when I’m feeling down. I find it hard to motivate myself to do anything, and I often just sit around, thinking about how hopeless things feel.",
        "When I’m feeling depressed, I usually cope by isolating myself. I stay in my room and sleep a lot, hoping that I’ll feel better when I wake up, but I rarely do."
      ],
      "Have there been any significant life changes that have affected how you view yourself or your relationships with others?": [
        "When I lost my job, I fell into a deep depression. It made me feel like I wasn’t good enough, and I started withdrawing from friends and family. I view myself in a more negative light now, and my relationships feel strained.",
        "After going through a major breakup, I felt like I lost my sense of self. I started questioning who I was outside of the relationship and felt very disconnected from the people around me."
      ],
      "Do you feel like you have control over your actions and decisions, or do you ever feel like something is taking over your thoughts or behavior?": [
        "I feel like depression takes over my ability to make decisions. Sometimes, I don’t even want to get out of bed, but I feel like I can’t control it. It’s like something else is influencing my actions and making everything feel so heavy.",
        "There are days when my thoughts are so dark that I feel like I can’t control my behavior. I push people away, and I don’t feel like myself. It’s like depression takes over and dictates how I interact with the world."
      ],
      "Have you had trouble sleeping lately? If so, what do you think is affecting your sleep?": [
        "I’ve been sleeping a lot more than usual, but it doesn’t feel restful. I wake up feeling tired and unmotivated. I think depression is affecting my sleep, making it hard for me to feel refreshed.",
        "I can’t fall asleep or stay asleep at night. My mind is always thinking about everything that’s wrong in my life. I think depression is the reason I can’t get a good night’s sleep."
      ],
      "Can you describe a situation or experience where you felt disconnected from your emotions or from others around you?": [
        "When I was really depressed, I felt like I was living in a dark cloud. I didn’t feel connected to anything, including my own emotions. It was like I was just going through the motions without actually feeling anything.",
        "I remember feeling completely disconnected from myself and others during a period of deep depression. It was like I was watching my life from the outside, unable to connect with my feelings or anyone else."
      ]
    },
    "BodyImage": {
      "Can you describe how you have been feeling emotionally over the past few weeks?": [
        "I hate looking in the mirror. All I see are flaws. I’ve been skipping meals and obsessively checking my weight. Even when people say I look fine, I don’t believe them. I feel disgusting, and it’s all I think about.",
        "I’ve been avoiding going out because I’m so self-conscious. I compare myself to everyone and always feel inadequate. Clothes shopping is a nightmare—nothing looks right. I just want to feel comfortable in my own skin."
      ],
      "Have you experienced any changes in your daily habits or routines that you’ve noticed recently? How has this affected you?": [
        "I’ve been paying more attention to my body lately, trying to eat healthier and work out more. I’ve noticed I’m obsessing over my appearance more than usual. It’s affecting my mood, as I’m often frustrated that I don’t look like what I envision.",
        "I’ve started restricting my diet and exercising excessively to lose weight. It’s taking up a lot of my day and energy, and I’ve been feeling more tired. It’s affecting my relationships because I avoid social events where food is involved."
      ],
      "Can you tell me about a time when you felt overwhelmed? What caused it, and how did you cope?": [
        "I felt overwhelmed when I tried on clothes for an event and didn’t like how I looked. It made me spiral into negative thoughts about my body, and I couldn’t focus on anything else. I decided to talk to a therapist about my body image issues, and over time, I started practicing self-compassion and focusing less on external appearance.",
        "There was a time when I was constantly comparing myself to others on social media, which left me feeling insecure. I felt overwhelmed with the pressure to look perfect. Talking to a therapist helped me realize that these feelings were rooted in unrealistic expectations, and with some practice, I learned to appreciate my body more."
      ],
      "What are some things you’ve been thinking about that seem to cause you a lot of distress or discomfort?": [
        "I’ve been thinking a lot about how I look, especially when I compare myself to others. I’m constantly worried about my weight and body shape, and it causes me a lot of distress. I feel like I’m never good enough, no matter what I do.",
        "I’m often preoccupied with how I appear to others. Every time I look in the mirror, I think about my flaws, and I feel upset. These thoughts make me uncomfortable, and I find it hard to focus on anything else."
      ],
      "How do you typically cope with situations that make you anxious or uncomfortable?": [
        "Whenever I feel uncomfortable with my body, I try to hide it by wearing baggy clothes or avoiding situations where I have to be seen. I sometimes go on restrictive diets, hoping that will make me feel better about myself.",
        "When I feel bad about my body, I compare myself to others, thinking that maybe if I looked like them, I would feel better. I also find myself focusing on the parts of my body I don’t like, hoping to change them somehow."
      ],
      "Have there been any significant life changes that have affected how you view yourself or your relationships with others?": [
        "After gaining weight, I started feeling very self-conscious about my appearance. It made me withdraw from social activities because I didn’t want others to judge me. It has affected how I view myself and made me question my worth.",
        "I’ve struggled with my body image for years, but a significant life change, like a major health issue, forced me to reassess how I view my body. I realized that I’ve been too hard on myself and need to accept who I am, regardless of my appearance."
      ],
      "Do you feel like you have control over your actions and decisions, or do you ever feel like something is taking over your thoughts or behavior?": [
        "I often feel like my body image issues control me. I obsess over every little detail about my appearance, and it impacts my decisions, like what I wear or whether I go out. It’s hard to feel free when I’m always thinking about how I look.",
        "When I look in the mirror, sometimes I feel like my perception of my body is distorted, and it controls my actions. I’ll avoid social situations or certain activities because I’m afraid of being judged, even if there’s no real reason to feel that way."
      ],
      "Have you had trouble sleeping lately? If so, what do you think is affecting your sleep?": [
        "I can’t sleep well because I keep thinking about how I look. I’ll lie in bed and start overanalyzing my body, which keeps me up for hours.",
        "Sometimes, I feel like I don’t deserve rest because I’m not happy with my body. It feels like my thoughts about my appearance affect my ability to relax and sleep peacefully."
      ],
      "Can you describe a situation or experience where you felt disconnected from your emotions or from others around you?": [
        "There have been times when I’ve been so caught up in how I look that I couldn’t connect with the people around me. It felt like I was in my own bubble, disconnected from everything else.",
        "I remember a situation when I was obsessing over my body image, and even though I was with close friends, I couldn’t emotionally engage with them. It felt like my mind was somewhere else, completely consumed by negative thoughts about my appearance."
      ]
    },
    "PTSD": {
      "Can you describe how you have been feeling emotionally over the past few weeks?": [
        "Flashbacks hit me out of nowhere, and I feel like I’m back in that moment. I’ve been jumpy, avoiding places that remind me of it. Nightmares wake me up sweating. I just want to feel safe again.",
        "I’ve been on edge, like danger is everywhere. Loud noises make me panic, and I can’t trust people easily. I feel broken, like what happened stole part of me."
      ],
      "Have you experienced any changes in your daily habits or routines that you’ve noticed recently? How has this affected you?": [
        "Since the trauma, I’ve noticed my routine has become unpredictable. I experience nightmares that leave me feeling disoriented the next day. I struggle to concentrate, and my work productivity has dropped as a result. I avoid certain places and people, which makes me feel more isolated.",
        "I’ve been avoiding things that remind me of the trauma, and it’s caused a shift in my daily life. I spend most of my time staying indoors, trying to manage flashbacks. My routine has become limited, and I often feel anxious and on edge."
      ],
      "Can you tell me about a time when you felt overwhelmed? What caused it, and how did you cope?": [
        "I felt overwhelmed when I had flashbacks to a traumatic event. The memories would consume me, making it hard to function. I reached out for therapy, and with the help of trauma-focused therapy, I was able to learn coping strategies and reduce the impact of the flashbacks.",
        "I felt overwhelmed after witnessing a traumatic incident. Every day, I struggled with anxiety, nightmares, and flashbacks. Therapy helped me process the trauma, and I learned grounding techniques to manage my symptoms."
      ],
      "What are some things you’ve been thinking about that seem to cause you a lot of distress or discomfort?": [
        "I keep thinking about the traumatic event, especially when I hear certain sounds or see specific places. These flashbacks make me feel panicked and unsafe, and it’s hard to control these intrusive thoughts.",
        "I keep reliving the trauma in my mind. Certain reminders bring it all back, and I get really distressed. These thoughts affect my ability to function normally and make me feel trapped in the past."
      ],
      "How do you typically cope with situations that make you anxious or uncomfortable?": [
        "I cope with my PTSD by avoiding reminders of the trauma, like staying away from certain places or people. It’s not a long-term solution, but it keeps me from feeling overwhelmed.",
        "When I start feeling triggered by memories of the trauma, I try to self-soothe by focusing on calming techniques like deep breathing or grounding myself. It helps, but the anxiety never really goes away."
      ],
      "Have there been any significant life changes that have affected how you view yourself or your relationships with others?": [
        "After my traumatic experience, I found myself withdrawing from social situations. I became hyper-vigilant and couldn’t trust anyone, which caused tension in my relationships and made me feel isolated.",
        "My PTSD has made me feel disconnected from the world. I no longer feel the same way about my friends and family, and I sometimes struggle to engage with them because of the overwhelming feelings of fear and anxiety."
      ],
      "Do you feel like you have control over your actions and decisions, or do you ever feel like something is taking over your thoughts or behavior?": [
        "When I experience flashbacks, it feels like my past is taking over my present. I can’t control my reactions, and it feels like I’m reliving the trauma all over again. My body and mind react in ways I don’t fully understand.",
        "There are moments when I feel completely overwhelmed by the trauma I experienced. It’s like my mind takes over and I’m not able to control my actions or emotions. It makes it hard to function in day-to-day life."
      ],
      "Have you had trouble sleeping lately? If so, what do you think is affecting your sleep?": [
        "I’ve been having nightmares and flashbacks, and it’s been making it really hard to sleep. I wake up in a panic, and it’s like my trauma takes over my nights.",
        "My sleep has been disrupted because I can’t stop thinking about the traumatic event. I wake up in the middle of the night, often feeling scared or unsafe, which prevents me from getting a full night’s rest."
      ],
      "Can you describe a situation or experience where you felt disconnected from your emotions or from others around you?": [
        "After my traumatic experience, I often felt like I was outside my own body. I didn’t connect with my feelings, and I had trouble being present with the people around me. It felt like I was numb.",
        "There were times after the trauma when I felt like I was just going through the motions, unable to feel anything. It was as if I was disconnected from myself and the world around me, like I was stuck in a haze."
      ]
    },
    "AlcoholUse": {
      "Can you describe how you have been feeling emotionally over the past few weeks?": [
        "Lately, I’ve been feeling really ashamed and out of control. I keep telling myself I’ll cut back on drinking, but then I end up finishing a whole bottle alone at night. I wake up with guilt, but by evening, the cravings take over. My hands shake if I don’t drink, and I’ve been avoiding friends because they’ve noticed my problem. I feel trapped.",
        "Emotionally, I’m a mess. Drinking used to help me relax, but now it’s just making everything worse. I’ve been missing work, and my family is angry with me. I feel numb most of the time, but when I try to stop, the anxiety is unbearable. I don’t know how to break this cycle."
      ],
      "Have you experienced any changes in your daily habits or routines that you have noticed recently? How has this affected you?": [
        "Recently, I’ve been drinking more often to cope with stress. I’ve noticed a shift in my daily routine where I now feel the need to drink in the evening just to relax. It’s affecting my productivity at work, and I’ve started feeling guilty about my reliance on alcohol.",
        "I used to drink socially, but lately, I find myself drinking alone more frequently. It’s changed my habits and my social life, as I no longer want to go out and be around people. I feel more isolated, and it’s definitely affecting my mood and energy levels."
      ],
      "Can you tell me about a time when you felt overwhelmed? What caused it, and how did you cope?": [
        "There was a time when I was working long hours at my job and felt like I couldn’t relax. To cope with the stress, I started drinking more frequently. It became a way to forget about the overwhelming feeling of not being able to manage my responsibilities. Eventually, I realized that alcohol was making things worse, and I decided to reach out for help. I started attending support group meetings, and slowly, I learned healthier coping strategies.",
        "I had a period where I was under a lot of pressure at work. The anxiety I felt led me to drink more than usual to cope. I started feeling like I couldn’t stop even when I wanted to. I decided to seek help through counseling, and now I focus on using relaxation techniques like breathing exercises to manage stress."
      ],
      "What are some things you’ve been thinking about that seem to cause you a lot of distress or discomfort?": [
        "I’ve been thinking a lot about how much I rely on alcohol to cope with stress. I feel like I can’t have a good time without it, and that thought really disturbs me. It makes me wonder if I’m losing control over my drinking habits.",
        "Lately, I’ve been constantly thinking about how often I drink. I know it’s affecting my health and relationships, but I can’t seem to stop. The thought of being dependent on alcohol makes me feel guilty and helpless."
      ],
      "How do you typically cope with situations that make you anxious or uncomfortable?": [
        "When I feel anxious, I tend to reach for a drink to calm myself down. I’ve noticed that alcohol helps numb my feelings, but deep down I know it’s not a healthy coping mechanism.",
        "Whenever I feel overwhelmed, I turn to alcohol to escape my thoughts. I know it’s not the best way to cope, but it feels like the only thing that helps me relax and stop thinking about everything at once."
      ],
      "Have there been any significant life changes that have affected how you view yourself or your relationships with others?": [
        "When I hit rock bottom with my drinking, it made me realize how much I was isolating myself from others. I felt ashamed and started distancing myself from friends and family, thinking they’d judge me. Now, I’m trying to rebuild those relationships.",
        "After I decided to stop drinking, my relationships started to improve. I felt like a new version of myself—someone who was capable of having meaningful connections without the fog of alcohol in the way."
      ],
      "Do you feel like you have control over your actions and decisions, or do you ever feel like something is taking over your thoughts or behavior?": [
        "There are times when I feel like I can’t control my urge to drink. I tell myself I won’t drink, but then something inside me takes over, and I end up drinking again. It’s frustrating because I feel like I’m not in control of my own actions.",
        "I sometimes feel like my addiction is making decisions for me. Even when I don’t want to drink, I find myself reaching for a bottle. It’s like a part of me isn’t in charge, and that’s been hard to accept."
      ],
      "Have you had trouble sleeping lately? If so, what do you think is affecting your sleep?": [
        "I’ve noticed that I can’t sleep well after drinking. I’ll pass out, but I wake up a few hours later feeling restless and uneasy. I think the alcohol messes with my sleep cycle.",
        "I’m struggling to sleep because I keep thinking about my next drink. Even when I try to sleep, my mind is racing, and I can’t relax long enough to fall into a deep sleep."
      ],
      "Can you describe a situation or experience where you felt disconnected from your emotions or from others around you?": [
        "There have been times when I’ve been drinking heavily, and I feel like I’m watching my life from the outside. I’m there, but I’m not really present. Conversations feel shallow, and I can’t connect emotionally with the people around me.",
        "Sometimes, when I’m sober after a long period of drinking, I feel empty inside. It’s like I’ve forgotten how to feel normal emotions, and I just go through the motions without really engaging with life or people."
      ]
    },
    "DrugUse": {
      "Can you describe how you have been feeling emotionally over the past few weeks?": [
        "I’ve been lying to everyone, even myself. I feel like I’m just going through the motions, but inside, I’m completely numb unless I’m using. There’s this heavy sadness that never leaves. I keep telling myself I’ll quit, but then I get high again and hate myself even more afterward.",
        "These past few weeks, I’ve been isolating myself. I feel lost, ashamed, and like no one really understands me. Using is the only thing that gives me a break from my thoughts, but it’s also the thing that’s ruining me. I just feel stuck and broken."
      ],
      "Have you experienced any changes in your daily habits or routines that you’ve noticed recently? How has this affected you?": [
        "Over the past few months, I’ve noticed myself slipping back into old habits—staying up all night, not eating, skipping work. Drugs have become the center of everything again, and I’m scared of how fast it all spiraled.",
        "I’ve started using more frequently, and my daily habits have changed drastically. I sleep all day, avoid people, and barely take care of myself. I can’t keep up with responsibilities, and everything feels out of control."
      ],
      "Can you tell me about a time when you felt overwhelmed? What caused it, and how did you cope?": [
        "There was a time when I had a lot of personal issues and I didn’t know how to deal with them. Instead of talking to someone, I started using more and more. It helped at first, but then it made everything worse. I ended up pushing people away and losing my job.",
        "I felt overwhelmed when I lost my job and turned to drugs to cope. I thought it would help me escape the stress, but it only made things harder. Eventually, I realized I needed help and checked into a program."
      ],
      "What are some things you’ve been thinking about that seem to cause you a lot of distress or discomfort?": [
        "I’ve been feeling a lot of distress about my constant urge to use. I can’t stop thinking about the next time I’ll get high, and that scares me. It’s like I’ve lost control of my own thoughts.",
        "The more I think about my drug use, the more anxious I get. I know it’s destroying my life, but I still can’t stop. That feeling of powerlessness eats at me every day."
      ],
      "How do you typically cope with situations that make you anxious or uncomfortable?": [
        "I usually turn to drugs when I’m feeling anxious or stressed. It’s become my automatic response. I know it’s not right, but it feels like the only thing that works.",
        "When I feel uncomfortable or anxious, I reach for drugs because they numb everything. It’s the easiest way to escape, even if I know it’s not healthy."
      ],
      "Have there been any significant life changes that have affected how you view yourself or your relationships with others?": [
        "My addiction to drugs caused a huge strain on my relationship with my family. They stopped trusting me, and I started to believe I wasn’t worth loving. It’s been really hard to fix that.",
        "When I went through rehab, I had to face how much I had hurt the people I care about. It changed how I see myself—I’m trying to be someone who’s honest and reliable, but it’s a daily battle."
      ],
      "Do you feel like you have control over your actions and decisions, or do you ever feel like something is taking over your thoughts or behavior?": [
        "When I was using drugs, I didn’t feel like I had control. It was like something else was calling the shots. I’d promise myself I’d stop, but I’d always end up using again.",
        "Even now that I’m sober, I still sometimes get these overwhelming urges that feel like they’re not even mine. I have to fight really hard not to give in, and that scares me."
      ],
      "Have you had trouble sleeping lately? If so, what do you think is affecting your sleep?": [
        "Since I stopped using drugs, my sleep has been all over the place. I get nightmares and wake up sweating. My body just doesn’t know how to rest anymore.",
        "I can’t sleep at night, and I feel anxious all the time. My mind races, and I keep thinking about everything I’ve done wrong. Sometimes I think using would just knock me out, but I know that’s a dangerous thought."
      ],
      "Can you describe a situation or experience where you felt disconnected from your emotions or from others around you?": [
        "When I was using drugs, I felt like I was living in a fog. People would talk to me, and I’d nod, but I wasn’t really there. I couldn’t feel anything—just emptiness.",
        "I remember a time when I was high, and it felt like everything around me was fake. I was surrounded by people, but I felt completely alone and detached from reality."
      ]
    },
    "GriefandLoss": {
      "Can you describe how you have been feeling emotionally over the past few weeks?": [
        "It’s been months, but the pain is still raw. I cry unexpectedly, and some days I can’t get out of bed. I feel guilty when I laugh or have a good moment—like I’m betraying them. I don’t know how to move forward.",
        "I swing between anger and deep sadness. I keep replaying memories, wondering if I could’ve done more. Some days, I just feel numb. People say time heals, but right now, it just hurts."
      ],
      "Have you experienced any changes in your daily habits or routines that you’ve noticed recently? How has this affected you?": [
        "Since losing a loved one, I’ve noticed that my routine has changed. I sleep more, avoid socializing, and don’t feel motivated to do things I once enjoyed. It’s affecting my ability to keep up with work, and I feel like I’m stuck in a cycle of sadness.",
        "I’ve been isolating myself more since the loss, and my daily habits have shifted. I spend most of my time at home, reminiscing about the past. It’s hard to stay focused on tasks, and I feel like I’m emotionally drained throughout the day."
      ],
      "Can you tell me about a time when you felt overwhelmed? What caused it, and how did you cope?": [
        "When I lost my father, I felt completely overwhelmed by grief. Every day felt like an emotional rollercoaster, and I couldn’t stop crying. I coped by isolating myself, but eventually, I sought therapy, where I was able to process my grief and find ways to honor my father’s memory while moving forward.",
        "I felt overwhelmed when I lost a close friend to illness. I couldn’t cope with the sadness, and it affected everything I did. I started seeing a grief counselor who helped me understand my emotions and provided coping strategies, like journaling and mindfulness."
      ],
      "What are some things you’ve been thinking about that seem to cause you a lot of distress or discomfort?": [
        "I’ve been thinking a lot about my loved one who passed away. I keep going over all the things I should have done or said before they left, and these thoughts make me feel guilty and deeply sad.",
        "I keep thinking about the void that’s been left in my life since the loss. I feel like I can’t move forward or find peace, and this thought of being stuck causes me a lot of distress and loneliness."
      ],
      "How do you typically cope with situations that make you anxious or uncomfortable?": [
        "When I feel the pain of loss, I try to keep busy with work or activities, so I don’t have to face the emptiness. But sometimes, when I stop, the grief hits me harder.",
        "I cope with my grief by talking to friends or family about the person I lost. Sometimes, I find comfort in crying and sharing memories, but it’s still hard to come to terms with everything."
      ],
      "Have there been any significant life changes that have affected how you view yourself or your relationships with others?": [
        "After losing my mother, I withdrew from most people. It affected my relationships because I couldn’t find the words to explain my grief. I started viewing myself as someone who was forever broken and unworthy of love.",
        "The death of my partner caused a huge shift in how I viewed myself. I stopped trusting others and pushed people away, fearing that they couldn’t understand the depth of my loss."
      ],
      "Do you feel like you have control over your actions and decisions, or do you ever feel like something is taking over your thoughts or behavior?": [
        "Since my partner passed away, I’ve had a hard time controlling my emotions. Sometimes, I’ll find myself crying uncontrollably, or I’ll snap at people without meaning to. It feels like grief is making all the decisions for me.",
        "Grief has made it hard to feel in control of my actions. I’ve withdrawn from friends and family, even though I know I shouldn’t. I feel like something is taking over and preventing me from connecting with others."
      ],
      "Have you had trouble sleeping lately? If so, what do you think is affecting your sleep?": [
        "Since my mother passed away, I’ve been having trouble sleeping. I keep waking up in the middle of the night, thinking about her. It’s like grief is keeping me awake.",
        "I have trouble sleeping because I keep reliving the moments leading up to my partner’s death. Every night, I find myself awake, overwhelmed by the loss, and I can’t seem to rest."
      ],
      "Can you describe a situation or experience where you felt disconnected from your emotions or from others around you?": [
        "After losing my father, I went through a period where I couldn’t feel my emotions at all. It was like I was watching everything happen from the outside, unable to connect with my grief or the people around me.",
        "During my grieving process, I remember feeling disconnected from everyone around me. I couldn’t feel my emotions like I used to, and it was as if I was just going through the motions, emotionally numb."
      ]
    },
    "IdentityCrisis": {
      "Can you describe how you have been feeling emotionally over the past few weeks?": [
        "I don’t know who I am anymore. My beliefs, my goals—everything feels uncertain. I keep questioning my choices, like I’m living someone else’s life. It’s exhausting, and I feel lost.",
        "I’ve been feeling disconnected from myself. Like I’m playing a role instead of being me. I don’t know what I want, and it’s making me anxious. Who am I, really?"
      ],
      "Have you experienced any changes in your daily habits or routines that you’ve noticed recently? How has this affected you?": [
        "Lately, I’ve been questioning who I am and what I want out of life. This has caused me to change my routine, spending more time reflecting on my identity and values. It’s left me feeling confused and unsure of how to move forward.",
        "I’ve been feeling lost and uncertain, and it’s causing me to withdraw from activities I used to enjoy. I find myself constantly re-evaluating my decisions, and it’s affecting my daily routine as I’m unsure about where I’m headed in life."
      ],
      "Can you tell me about a time when you felt overwhelmed? What caused it, and how did you cope?": [
        "During a major life change, I felt like I didn’t know who I was anymore. I was overwhelmed by the feeling of not belonging, and it caused confusion. I spoke with a counselor who guided me through understanding my identity and helped me discover my true self.",
        "I was overwhelmed during a time when I questioned my life choices and where I was headed. It felt like I was lost. Therapy helped me reflect on my values and gave me clarity on my identity."
      ],
      "What are some things you’ve been thinking about that seem to cause you a lot of distress or discomfort?": [
        "I keep wondering who I really am and what I’m supposed to be doing with my life. These thoughts of being lost and unsure about my identity make me feel restless and uneasy. It’s like I don’t fit anywhere.",
        "I often think about how uncertain I am about my future. I feel like I’m at a crossroads, and the pressure to figure it all out is overwhelming. These thoughts are constantly causing me discomfort and confusion."
      ],
      "How do you typically cope with situations that make you anxious or uncomfortable?": [
        "When I feel confused about my identity, I try to find distractions by focusing on my career or other achievements. It doesn’t really solve the problem, but it keeps me from thinking too much about it.",
        "I cope with my identity crisis by trying to explore different aspects of myself. I try out new hobbies or ways of dressing to see if they help me figure out who I really am."
      ],
      "Have there been any significant life changes that have affected how you view yourself or your relationships with others?": [
        "After going through a big career change, I started questioning who I was and what I wanted from life. It made me feel disconnected from my friends and family because I wasn’t sure where I fit in anymore.",
        "I went through a phase where I felt like I didn’t know who I was anymore. It was hard for me to relate to anyone, and my relationships started to feel strained because I was constantly searching for my true self."
      ],
      "Do you feel like you have control over your actions and decisions, or do you ever feel like something is taking over your thoughts or behavior?": [
        "Since I’ve been questioning who I am, I don’t always feel in control of my decisions. Sometimes, I’ll do things or say things that don’t align with who I thought I was. It’s like I’m still trying to figure out who is making the choices.",
        "There are times when I feel like I’m being pulled in so many directions, and I don’t know which path to take. It’s like I’m not fully in control of my own identity anymore, and that leaves me feeling lost."
      ],
      "Have you had trouble sleeping lately? If so, what do you think is affecting your sleep?": [
        "I’ve been feeling lost, and I can’t sleep because I keep thinking about who I am. I question my choices and who I’ve become, and it makes it hard to relax and fall asleep.",
        "My sleep has been affected because I’m constantly thinking about my identity and the decisions I need to make about my future. It feels like my mind is on overdrive, and it keeps me awake."
      ],
      "Can you describe a situation or experience where you felt disconnected from your emotions or from others around you?": [
        "When I was struggling with my identity, I felt completely disconnected from who I was. I couldn’t connect with my emotions or the people around me because I wasn’t sure of myself anymore.",
        "There was a time when I felt so lost that I couldn’t connect with my own feelings. It was like I didn’t know who I was or where I belonged, and I started to disconnect from those around me too."
      ]
    },
    "OCD": {
      "Can you describe how you have been feeling emotionally over the past few weeks?": [
        "My thoughts are on a loop—what if I left the stove on? What if I hurt someone? I check things over and over, but the fear never goes away. It’s exhausting, and I hate feeling so out of control.",
        "I have these intrusive thoughts that won’t stop, and if I don’t do my rituals, something bad will happen. I know it’s irrational, but I can’t stop. I just want my brain to be quiet."
      ],
      "Have you experienced any changes in your daily habits or routines that you’ve noticed recently? How has this affected you?": [
        "I’ve been spending more time on rituals, like checking things repeatedly and cleaning excessively. It’s changed my daily routine and taken up much more of my time. It’s making me feel anxious, and I often have to cancel plans because I can’t break away from these compulsions.",
        "Recently, I’ve noticed my need to organize everything around me has intensified. I’ve been spending more time rearranging things, which is disrupting my work schedule. It’s exhausting, and I find myself unable to focus on anything else."
      ],
      "Can you tell me about a time when you felt overwhelmed? What caused it, and how did you cope?": [
        "I was overwhelmed by obsessive thoughts about cleanliness and order. It became impossible to focus on anything else, and I spent hours cleaning. I sought help from a therapist, who taught me cognitive-behavioral techniques to manage these obsessive thoughts.",
        "I felt overwhelmed when I couldn’t stop checking things, like locking doors or turning off the lights. I realized it was becoming a major problem in my life, and I decided to seek help. Cognitive-behavioral therapy helped me break the cycle of compulsions."
      ],
      "What are some things you’ve been thinking about that seem to cause you a lot of distress or discomfort?": [
        "I keep thinking about the need to make sure everything is perfect. If something’s not in place, it bothers me deeply, and I can’t move on until I’ve checked and rechecked it. These thoughts are overwhelming and exhausting.",
        "I often think that something bad will happen if I don’t complete my rituals. I know it’s irrational, but the thought of not doing them causes a lot of distress and anxiety. It’s a constant battle with myself."
      ],
      "How do you typically cope with situations that make you anxious or uncomfortable?": [
        "I cope with my OCD by performing rituals, like checking locks or washing my hands multiple times. It helps ease the anxiety, but I know it’s a temporary fix and that I’m just reinforcing the cycle.",
        "I cope by organizing things or counting objects to manage the intrusive thoughts. It gives me a momentary relief, but it always comes back, and I feel like I can never truly relax."
      ],
      "Have there been any significant life changes that have affected how you view yourself or your relationships with others?": [
        "After developing obsessive-compulsive behaviors, I started to distance myself from people because I was embarrassed by my rituals. My relationships suffered because I couldn’t stop focusing on my compulsions.",
        "My OCD has made me very rigid in how I approach life. I often feel like I’m not in control, and it’s caused problems in my relationships because I’m constantly focused on my rituals rather than being present with others."
      ],
      "Do you feel like you have control over your actions and decisions, or do you ever feel like something is taking over your thoughts or behavior?": [
        "With OCD, it feels like my thoughts are controlling my actions. I have to repeat certain behaviors, like washing my hands over and over, even though I know it’s irrational. It’s like I don’t have a choice in the matter.",
        "My compulsions feel like they take over my life. Even when I try to resist, I feel like I’m not in control. It’s a constant struggle, like my mind is forcing me to follow certain rituals."
      ],
      "Have you had trouble sleeping lately? If so, what do you think is affecting your sleep?": [
        "I can’t sleep because I keep obsessing over whether I locked the door or turned off the stove. I have to get up several times to check, and it disrupts my sleep.",
        "When I try to fall asleep, my mind is filled with compulsions that I can’t shake off. I’ll spend hours going over rituals or thoughts in my head, which keeps me awake at night."
      ],
      "Can you describe a situation or experience where you felt disconnected from your emotions or from others around you?": [
        "During my worst OCD episodes, I felt disconnected from my emotions. I couldn’t focus on anything other than my compulsions, and I didn’t feel like I was really present with anyone.",
        "When I get caught up in my obsessive thoughts, I often feel like I’m not really there. I’m physically present, but emotionally and mentally, I’m somewhere else, disconnected from the moment."
      ]
    },
    "SelfEsteem": {
      "Can you describe how you have been feeling emotionally over the past few weeks?": [
        "I constantly feel like I’m not good enough. I compare myself to others and always come up short. Even compliments feel like lies. I just want to believe in myself for once.",
        "I’ve been avoiding challenges because I’m scared of failing. I criticize myself nonstop, and it’s hard to accept love from others. I feel unworthy, like I don’t deserve happiness."
      ],
      "Have you experienced any changes in your daily habits or routines that you’ve noticed recently? How has this affected you?": [
        "I’ve been more critical of myself lately, and it’s affecting my daily habits. I find myself avoiding mirrors, and I can’t help but focus on my flaws. My routine has been impacted because I spend more time worrying about how I look rather than engaging in normal activities.",
        "I’ve stopped participating in social events because I feel too self-conscious. I’ve noticed a change in my daily routine, where I spend more time alone, thinking about my perceived shortcomings. It’s lowering my self-confidence and affecting my relationships."
      ],
      "Can you tell me about a time when you felt overwhelmed? What caused it, and how did you cope?": [
        "I felt overwhelmed when I compared myself to others and felt like I was not good enough. It led to negative thoughts and low self-worth. I sought therapy, where I worked on building my self-esteem and learned to focus on my strengths.",
        "I was overwhelmed with feelings of inadequacy when I didn’t meet the expectations I had set for myself. I struggled with negative self-talk until I started seeing a therapist, who helped me reframe my thoughts and practice self-acceptance."
      ],
      "What are some things you’ve been thinking about that seem to cause you a lot of distress or discomfort?": [
        "I keep thinking about how inadequate I am compared to others. No matter what I achieve, it never feels like enough. These thoughts of being inferior to everyone else make me feel worthless and anxious.",
        "I often think that I’m not good enough, and these thoughts constantly undermine my confidence. They make it hard for me to enjoy anything or feel proud of myself."
      ],
      "How do you typically cope with situations that make you anxious or uncomfortable?": [
        "When I feel bad about myself, I try to seek validation from others by asking for compliments or approval. It makes me feel better temporarily, but it doesn’t last, and I end up feeling just as insecure again.",
        "I cope by trying to be perfect in everything I do, thinking that if I can just prove my worth, I’ll feel better about myself. But it never really helps, and I’m constantly disappointed."
      ],
      "Have there been any significant life changes that have affected how you view yourself or your relationships with others?": [
        "After being criticized at work, I began to see myself as inadequate. I started distancing myself from my friends because I felt unworthy of their support and love.",
        "I’ve always had low self-esteem, and after a few negative experiences, I began to believe that I wasn’t good enough for anyone. It affected how I interacted with people and made me feel like I didn’t deserve healthy relationships."
      ],
      "Do you feel like you have control over your actions and decisions, or do you ever feel like something is taking over your thoughts or behavior?": [
        "My low self-esteem often makes me second-guess every decision I make. I don’t feel like I have control over my actions because I’m always worried about what others think of me. It’s exhausting.",
        "I constantly feel like I’m not good enough, and that affects how I act. I make decisions based on what I think others expect from me, not what I really want, and it makes me feel out of control."
      ],
      "Have you had trouble sleeping lately? If so, what do you think is affecting your sleep?": [
        "I’ve been having trouble sleeping because I keep thinking about my self-worth. I feel like I’m not good enough, and those thoughts won’t let me rest.",
        "When I lie down to sleep, I start thinking about all my failures and how I’m not measuring up. It feels like my low self-esteem affects my ability to fall asleep."
      ],
      "Can you describe a situation or experience where you felt disconnected from your emotions or from others around you?": [
        "When I feel down about myself, I often disconnect emotionally from others. I don’t feel like I deserve to be around people, so I shut myself off and feel completely detached from my emotions.",
        "There was a time when I felt like I didn’t matter, and I couldn’t connect with anyone, not even myself. I felt emotionally distant and numb, as if I had no value."
      ]
    },
    "SleepdisorderInsomnia": {
      "Can you describe how you have been feeling emotionally over the past few weeks?": [
        "No matter how much I sleep, I’m always exhausted. I fall asleep at work, and it’s affecting my life. I feel like a zombie—no energy, no motivation. It’s frustrating.",
        "I could sleep all day and still feel drained. My brain is foggy, and I can’t focus. People think I’m lazy, but I just can’t stay awake. I don’t know what’s wrong with me."
      ],
      "Have you experienced any changes in your daily habits or routines that you’ve noticed recently? How has this affected you?": [
        "I’ve been feeling tired all day and have trouble staying awake. I find myself taking long naps during the day, which has disrupted my work routine. It’s affecting my productivity, and I often feel sluggish and unmotivated.",
        "I’ve noticed that I can’t stay awake for long periods, no matter how much sleep I get at night. I feel constantly drained, which makes it hard to keep up with my daily activities. My routine has become less productive, and I feel frustrated by the lack of energy."
      ],
      "Can you tell me about a time when you felt overwhelmed? What caused it, and how did you cope?": [
        "I felt overwhelmed by constant fatigue. No matter how much I slept, I never felt rested. It affected my daily life, and I sought help from a sleep therapist who gave me techniques to improve my sleep hygiene and manage my energy levels.",
        "I struggled with excessive sleepiness for months. It was difficult to stay awake during the day, and it affected my work and relationships. I went to a sleep specialist, who helped me identify the underlying causes and taught me strategies to improve my sleep quality."
      ],
      "What are some things you’ve been thinking about that seem to cause you a lot of distress or discomfort?": [
        "I keep thinking about how tired I always feel, no matter how much sleep I get. It’s like I can’t escape this exhaustion. It’s affecting my mood, and these thoughts of never feeling rested make me anxious about my health.",
        "I often think about how I can’t stay awake during the day. It feels like I’m always fighting to stay alert, and these thoughts make me feel frustrated and helpless."
      ],
      "How do you typically cope with situations that make you anxious or uncomfortable?": [
        "When I feel excessively tired during the day, I try to take naps or rest. But even after resting, I still feel drained, and I can’t seem to get a good night’s sleep.",
        "I cope with my sleepiness by relying on caffeine to stay awake. It works for a short time, but I always crash later, and it doesn’t really solve the underlying exhaustion."
      ],
      "Have there been any significant life changes that have affected how you view yourself or your relationships with others?": [
        "My sleep disorder has made me feel disconnected from others. I’m constantly tired and can’t keep up with social engagements, which has affected how I view myself and my relationships.",
        "I’ve become frustrated with myself because of my constant tiredness. It’s affected my social life because I often cancel plans, and I feel like my friends don’t understand the impact it’s having on me."
      ],
      "Do you feel like you have control over your actions and decisions, or do you ever feel like something is taking over your thoughts or behavior?": [
        "My excessive tiredness feels like it’s in control of my life. I can’t focus on anything, and I end up feeling like I’m not in control of my day. It’s frustrating because I know I should be more productive, but I can’t help it.",
        "I can’t seem to stay awake during the day, and it’s affecting everything. I try to control my sleep schedule, but I just can’t manage it, and it’s like the tiredness has control over my actions."
      ],
      "Have you had trouble sleeping lately? If so, what do you think is affecting your sleep?": [
        "I sleep a lot during the day because I’m always tired, but at night, I can’t stay awake. It feels like I’m stuck in this cycle of exhaustion and can’t get the right balance.",
        "I constantly feel tired, no matter how much sleep I get. It’s affecting my energy levels, and I feel like I can’t stay awake during the day. But at night, I struggle to sleep well."
      ],
      "Can you describe a situation or experience where you felt disconnected from your emotions or from others around you?": [
        "Sometimes, I feel so tired that I can’t connect with anything around me. It’s like I’m in a fog, emotionally detached, just going through the motions of the day without really feeling anything.",
        "My excessive tiredness makes me feel disconnected from my emotions. I can barely keep my eyes open, and it’s like I’m in a haze, not really engaging with my feelings or the people around me."
      ]
    },
    "SleepDisorder": {
      "Can you describe how you have been feeling emotionally over the past few weeks?": [
        "No matter how much I sleep, I’m always exhausted. I fall asleep at work, and it’s affecting my life. I feel like a zombie—no energy, no motivation. It’s frustrating.",
        "I could sleep all day and still feel drained. My brain is foggy, and I can’t focus. People think I’m lazy, but I just can’t stay awake. I don’t know what’s wrong with me."
      ],
      "Have you experienced any changes in your daily habits or routines that you’ve noticed recently? How has this affected you?": [
        "I’ve been feeling tired all day and have trouble staying awake. I find myself taking long naps during the day, which has disrupted my work routine. It’s affecting my productivity, and I often feel sluggish and unmotivated.",
        "I’ve noticed that I can’t stay awake for long periods, no matter how much sleep I get at night. I feel constantly drained, which makes it hard to keep up with my daily activities. My routine has become less productive, and I feel frustrated by the lack of energy."
      ],
      "Can you tell me about a time when you felt overwhelmed? What caused it, and how did you cope?": [
        "I felt overwhelmed by constant fatigue. No matter how much I slept, I never felt rested. It affected my daily life, and I sought help from a sleep therapist who gave me techniques to improve my sleep hygiene and manage my energy levels.",
        "I struggled with excessive sleepiness for months. It was difficult to stay awake during the day, and it affected my work and relationships. I went to a sleep specialist, who helped me identify the underlying causes and taught me strategies to improve my sleep quality."
      ],
      "What are some things you’ve been thinking about that seem to cause you a lot of distress or discomfort?": [
        "I keep thinking about how tired I always feel, no matter how much sleep I get. It’s like I can’t escape this exhaustion. It’s affecting my mood, and these thoughts of never feeling rested make me anxious about my health.",
        "I often think about how I can’t stay awake during the day. It feels like I’m always fighting to stay alert, and these thoughts make me feel frustrated and helpless."
      ],
      "How do you typically cope with situations that make you anxious or uncomfortable?": [
        "When I feel excessively tired during the day, I try to take naps or rest. But even after resting, I still feel drained, and I can’t seem to get a good night’s sleep.",
        "I cope with my sleepiness by relying on caffeine to stay awake. It works for a short time, but I always crash later, and it doesn’t really solve the underlying exhaustion."
      ],
      "Have there been any significant life changes that have affected how you view yourself or your relationships with others?": [
        "My sleep disorder has made me feel disconnected from others. I’m constantly tired and can’t keep up with social engagements, which has affected how I view myself and my relationships.",
        "I’ve become frustrated with myself because of my constant tiredness. It’s affected my social life because I often cancel plans, and I feel like my friends don’t understand the impact it’s having on me."
      ],
      "Do you feel like you have control over your actions and decisions, or do you ever feel like something is taking over your thoughts or behavior?": [
        "My excessive tiredness feels like it’s in control of my life. I can’t focus on anything, and I end up feeling like I’m not in control of my day. It’s frustrating because I know I should be more productive, but I can’t help it.",
        "I can’t seem to stay awake during the day, and it’s affecting everything. I try to control my sleep schedule, but I just can’t manage it, and it’s like the tiredness has control over my actions."
      ],
      "Have you had trouble sleeping lately? If so, what do you think is affecting your sleep?": [
        "I sleep a lot during the day because I’m always tired, but at night, I can’t stay awake. It feels like I’m stuck in this cycle of exhaustion and can’t get the right balance.",
        "I constantly feel tired, no matter how much sleep I get. It’s affecting my energy levels, and I feel like I can’t stay awake during the day. But at night, I struggle to sleep well."
      ],
      "Can you describe a situation or experience where you felt disconnected from your emotions or from others around you?": [
        "Sometimes, I feel so tired that I can’t connect with anything around me. It’s like I’m in a fog, emotionally detached, just going through the motions of the day without really feeling anything.",
        "My excessive tiredness makes me feel disconnected from my emotions. I can barely keep my eyes open, and it’s like I’m in a haze, not really engaging with my feelings or the people around me."
      ]
    },
    "SocialAnxiety": {
      "Can you describe how you have been feeling emotionally over the past few weeks?": [
        "I overanalyze every interaction, convinced I said something stupid. I avoid parties and even work meetings. My heart races just thinking about small talk. I feel so alone.",
        "I panic before social events, and sometimes I cancel last minute. I worry people are judging me, even when they’re not. I want to connect, but fear holds me back."
      ],
      "Have you experienced any changes in your daily habits or routines that you’ve noticed recently? How has this affected you?": [
        "I’ve noticed I’ve been avoiding social situations more recently. I’m constantly worried about what others think of me, which has caused me to stay home and skip events. My daily routine has become isolated, and I feel disconnected from my friends and family.",
        "I’ve been withdrawing from social activities because I feel overwhelmed by the idea of interacting with others. I spend more time alone, worrying about how I’ll be perceived. It’s affecting my routine because I avoid places where I might encounter others."
      ],
      "Can you tell me about a time when you felt overwhelmed? What caused it, and how did you cope?": [
        "I felt overwhelmed at a social gathering when I couldn’t stop worrying about how others were perceiving me. I avoided talking to anyone and left early. I started therapy, where I learned how to challenge my anxious thoughts and interact with others more comfortably.",
        "Social situations would overwhelm me because I constantly felt judged or criticized. I would often avoid gatherings to prevent the anxiety. Therapy helped me build confidence in social interactions by teaching me coping strategies."
      ],
      "What are some things you’ve been thinking about that seem to cause you a lot of distress or discomfort?": [
        "I keep thinking about how others perceive me, especially in social situations. The idea that people might be judging me makes me incredibly anxious, and it’s preventing me from participating in activities I once enjoyed.",
        "I often think about how I’ll be awkward or say something wrong in front of people. These thoughts make it hard for me to be myself and enjoy social interactions, and it leaves me feeling uncomfortable and self-conscious."
      ],
      "How do you typically cope with situations that make you anxious or uncomfortable?": [
        "When I feel socially anxious, I try to avoid situations that make me uncomfortable, like parties or meetings. I know it’s not helping me face my fears, but it feels like the only way to manage the anxiety.",
        "I cope with my social anxiety by preparing extensively for conversations or events. I write down what I’m going to say and rehearse it, hoping it will help me feel more confident."
      ],
      "Have there been any significant life changes that have affected how you view yourself or your relationships with others?": [
        "After struggling with social anxiety, I’ve started avoiding events and gatherings. I’m scared of being judged, which has led to me distancing myself from friends and family, making me feel more isolated.",
        "Social anxiety has made me overthink every interaction. I often feel like I’m not good enough for the people around me, and it’s caused me to withdraw from people I care about."
      ],
      "Do you feel like you have control over your actions and decisions, or do you ever feel like something is taking over your thoughts or behavior?": [
        "My social anxiety makes it hard to feel in control of my actions. In social situations, I often freeze up, and my thoughts race. It’s like something takes over and prevents me from acting naturally.",
        "I often feel like my anxiety is controlling me. I second-guess everything I say or do in social situations, and it’s hard to feel in control when I’m constantly worried about how others perceive me."
      ],
      "Have you had trouble sleeping lately? If so, what do you think is affecting your sleep?": [
        "I often feel anxious at night, especially when I think about social interactions the next day. I’ll lay in bed, worrying about what I said or what I’ll wear, and it keeps me from falling asleep.",
        "I can’t sleep well because I’m always thinking about what others think of me. My social anxiety makes me overthink every interaction, which leaves me restless at night."
      ],
      "Can you describe a situation or experience where you felt disconnected from your emotions or from others around you?": [
        "When I’m in social situations, I often feel disconnected from everyone. It’s like I’m observing myself from the outside, unable to engage with my emotions or the people around me.",
        "I’ve had times where I feel disconnected from my emotions when I’m in a crowd. I become so anxious that I can’t connect with what I’m feeling or with the people around me. It’s like I’m in a bubble, separated from everyone."
      ]
    },
    "Stress": {
      "Can you describe how you have been feeling emotionally over the past few weeks?": [
        "I’m constantly overwhelmed—work, family, bills. My muscles are always tense, and I snap at little things. I can’t remember the last time I felt relaxed.",
        "My to-do list never ends, and I feel like I’m drowning. I have trouble sleeping, and my mind won’t slow down. I don’t know how to cope anymore."
      ],
      "Have you experienced any changes in your daily habits or routines that you’ve noticed recently? How has this affected you?": [
        "I’ve been feeling stressed with the demands of work, and it’s changed my routine. I’ve been staying late to finish tasks, but I end up feeling burnt out and drained. My routine has become overpacked, and I’m not making time for relaxation anymore.",
        "Lately, the pressure at work has been overwhelming. I’ve found myself working longer hours and skipping meals. My daily habits have become erratic, and I’m feeling more stressed and exhausted, which affects my mood and ability to concentrate."
      ],
      "Can you tell me about a time when you felt overwhelmed? What caused it, and how did you cope?": [
        "I was overwhelmed by work stress, with tight deadlines and endless tasks. It made me anxious, and I started experiencing physical symptoms like headaches. I sought therapy and learned stress-management techniques like deep breathing and time management.",
        "When life became too hectic, I felt overwhelmed by the constant pressure. It led to burnout, and I realized I needed help. Therapy helped me manage my stress through mindfulness and by setting boundaries."
      ],
      "What are some things you’ve been thinking about that seem to cause you a lot of distress or discomfort?": [
        "I keep thinking about how much I have to do and how little time I have. It’s overwhelming, and I can’t seem to relax because I’m constantly thinking about my to-do list and the pressure I’m under.",
        "I’ve been thinking about how stressed I am at work and in my personal life. I feel like I’m constantly running on empty, and these thoughts about never having enough time or energy are causing me a lot of distress."
      ],
      "How do you typically cope with situations that make you anxious or uncomfortable?": [
        "When I feel stressed, I try to keep busy with work to avoid thinking about it. It helps for a while, but the stress always comes back once I stop working.",
        "I cope with stress by exercising or going for a run. It helps me release some tension and clear my mind, but once I stop, the stress starts building up again."
      ],
      "Have there been any significant life changes that have affected how you view yourself or your relationships with others?": [
        "My stress levels have skyrocketed recently due to work pressures, and I’ve noticed that it’s impacting my relationships. I feel irritable and overwhelmed, and I’m not as present with my loved ones as I should be.",
        "After experiencing a high level of stress, I’ve started to feel like I’m losing control. My relationships have been affected because I’m often preoccupied with work and can’t focus on the people around me."
      ],
      "Do you feel like you have control over your actions and decisions, or do you ever feel like something is taking over your thoughts or behavior?": [
        "Stress has been taking over my life lately. I feel overwhelmed and like I can’t make decisions without stressing about the consequences. It’s hard to feel in control when everything feels urgent.",
        "When I’m stressed, it’s like my mind can’t focus on anything. I start making decisions without thinking clearly, and it feels like stress is in charge of my actions, not me."
      ],
      "Have you had trouble sleeping lately? If so, what do you think is affecting your sleep?": [
        "Stress has been keeping me up lately. I feel overwhelmed by everything I have to do, and when I try to sleep, my mind races with tasks and worries. I just can’t seem to switch off.",
        "There’s so much on my plate right now, and it’s affecting my sleep. I lie in bed thinking about all the things I need to get done, and the stress prevents me from relaxing enough to fall asleep."
      ],
      "Can you describe a situation or experience where you felt disconnected from your emotions or from others around you?": [
        "When I’m under a lot of stress, I sometimes feel emotionally detached. It’s like I’m just going through the motions without truly connecting with my emotions or the people around me.",
        "Stress has made me feel like I’m emotionally numb. I’m so overwhelmed by everything that I can’t connect with how I’m feeling or with those around me. It’s like I’m stuck in my own head."
      ]
    }
  }
}
